# 数据聚合和分组运算

In [1]:
import numpy as np
from numpy import NaN as NA
import pandas as pd
from numpy.random import randn
from numpy.linalg import inv,qr, eig ,det ,svd

import matplotlib.pyplot as plt
import random

from pandas import DataFrame , Series

In [2]:
df = DataFrame({ 'key1':list('aabba'),
                'key2':'one,two,one,two,one'.split(','),
                'data1':np.random.randn(5),
                'data2':np.random.randn(5)
            
})

In [3]:
df

      data1     data2 key1 key2
0  0.999050 -0.094037    a  one
1  1.640705  0.587479    a  two
2 -1.202413  0.539482    b  one
3  1.517189  0.056848    b  two
4 -1.939885  0.142478    a  one

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a    0.233290
b    0.157388
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [8]:
means

key1  key2
a     one    -0.470417
      two     1.640705
b     one    -1.202413
      two     1.517189
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a    -0.470417  1.640705
b    -1.202413  1.517189

In [10]:
states = np.array('Ohio,Calfornia,California,Ohio,Ohio'.split(','))

In [11]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [12]:
df['data1'].groupby([states, years]).mean()

Calfornia   2005    1.640705
California  2006   -1.202413
Ohio        2005    1.258120
            2006   -1.939885
Name: data1, dtype: float64

In [13]:
df

      data1     data2 key1 key2
0  0.999050 -0.094037    a  one
1  1.640705  0.587479    a  two
2 -1.202413  0.539482    b  one
3  1.517189  0.056848    b  two
4 -1.939885  0.142478    a  one

In [14]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.233290  0.211973
b     0.157388  0.298165

In [15]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -0.470417  0.024221
     two   1.640705  0.587479
b    one  -1.202413  0.539482
     two   1.517189  0.056848

In [16]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

## 对分组进行迭代

In [17]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0  0.999050 -0.094037    a  one
1  1.640705  0.587479    a  two
4 -1.939885  0.142478    a  one
b
      data1     data2 key1 key2
2 -1.202413  0.539482    b  one
3  1.517189  0.056848    b  two

In [18]:
for (k1, k2), group in df.groupby('key1,key2'.split(',')):
    print(k1,k2)
    print(group)
    print('=========')

a one
      data1     data2 key1 key2
0  0.999050 -0.094037    a  one
4 -1.939885  0.142478    a  one
=========
a two
      data1     data2 key1 key2
1  1.640705  0.587479    a  two
=========
b one
      data1     data2 key1 key2
2 -1.202413  0.539482    b  one
=========
b two
      data1     data2 key1 key2
3  1.517189  0.056848    b  two
=========

In [19]:
pieces =dict(list(df.groupby(['key1'])))

In [20]:
pieces['b']

      data1     data2 key1 key2
2 -1.202413  0.539482    b  one
3  1.517189  0.056848    b  two

In [21]:
list(df.groupby(['key1']))

[('a',       data1     data2 key1 key2
  0  0.999050 -0.094037    a  one
  1  1.640705  0.587479    a  two
  4 -1.939885  0.142478    a  one), ('b',       data1     data2 key1 key2
  2 -1.202413  0.539482    b  one
  3  1.517189  0.056848    b  two)]

In [22]:
dict([('a', 'n')])

{'a': 'n'}

In [23]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [24]:
grouped = df.groupby(df.dtypes, axis = 1)

In [25]:
dict(list(grouped))

{dtype('float64'):       data1     data2
 0  0.999050 -0.094037
 1  1.640705  0.587479
 2 -1.202413  0.539482
 3  1.517189  0.056848
 4 -1.939885  0.142478, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [26]:
df

      data1     data2 key1 key2
0  0.999050 -0.094037    a  one
1  1.640705  0.587479    a  two
2 -1.202413  0.539482    b  one
3  1.517189  0.056848    b  two
4 -1.939885  0.142478    a  one

In [27]:
grouped.mean()

DataError: No numeric types to aggregate

## 选取一个或者一组列

In [ ]:
df.groupby('key1')['data1']

In [ ]:
df.groupby('key1')[['data2']]

In [ ]:
df.groupby('key1')['data1'].mean()

In [ ]:
df.groupby('key1')[['data2']].mean()

In [28]:
s_grouped = df.groupby(['key1', 'key2'])['data2']

In [29]:
s_grouped

In [30]:
s_grouped.mean()

key1  key2
a     one     0.024221
      two     0.587479
b     one     0.539482
      two     0.056848
Name: data2, dtype: float64

## 通过字典和Series进行分组

In [31]:
people = DataFrame(np.random.randn(5, 5),
                   columns=list('abcde'),
                   index='Joe,Steve,Wes,Jim,Travis'.split(',')

)

In [32]:
people

               a         b         c         d         e
Joe    -1.978465  1.153454 -0.038719  0.734191  0.405998
Steve  -0.353598 -1.040794 -1.265739  1.384710  0.719764
Wes     1.609915  0.548832  0.453520  0.578642  0.446704
Jim     0.182879 -2.079879 -0.141831 -1.372441 -0.425942
Travis -0.173727  2.653995 -0.516163  1.027742  0.234260

In [33]:
people.loc[2:3, list('bc')] = np.nan

In [34]:
people

               a         b         c         d         e
Joe    -1.978465  1.153454 -0.038719  0.734191  0.405998
Steve  -0.353598 -1.040794 -1.265739  1.384710  0.719764
Wes     1.609915       NaN       NaN  0.578642  0.446704
Jim     0.182879 -2.079879 -0.141831 -1.372441 -0.425942
Travis -0.173727  2.653995 -0.516163  1.027742  0.234260

In [35]:
mapping = {
    'a':'red',
    'b':'red',
    'c':'blue',
    'b':'blue',
    'e':'red',
    'f':'orange',
    
}

In [36]:
by_column = people.groupby(mapping, axis=1)

In [37]:
by_column.sum()

            blue       red
Joe     1.114734 -1.572468
Steve  -2.306533  0.366166
Wes          NaN  2.056619
Jim    -2.221709 -0.243063
Travis  2.137832  0.060534

In [38]:
map_series = Series(mapping)

In [39]:
map_series

a       red
b      blue
c      blue
e       red
f    orange
dtype: object

In [40]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    2
Steve      2    2
Wes        0    2
Jim        2    2
Travis     2    2

## 通过函数进行分组

In [41]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.185671 -0.926425 -0.180550 -0.059608  0.426759
5 -0.353598 -1.040794 -1.265739  1.384710  0.719764
6 -0.173727  2.653995 -0.516163  1.027742  0.234260

In [42]:
people

               a         b         c         d         e
Joe    -1.978465  1.153454 -0.038719  0.734191  0.405998
Steve  -0.353598 -1.040794 -1.265739  1.384710  0.719764
Wes     1.609915       NaN       NaN  0.578642  0.446704
Jim     0.182879 -2.079879 -0.141831 -1.372441 -0.425942
Travis -0.173727  2.653995 -0.516163  1.027742  0.234260

## 根据索引级别进行分组

In [43]:
columns = pd.MultiIndex.from_arrays([
    'US,US,US,JP,JP'.split(','),
    [1, 3, 5, 1, 3]],
    names = ['cty', 'tenor']


)

In [44]:
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           labels=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [45]:
hier_df = DataFrame(np.random.randn(4, 5), columns = columns)

In [46]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -0.818437  0.529596  0.461068  0.820986  0.495715
1      0.036830 -0.535788  0.259759 -1.881591 -1.365679
2     -0.702715 -2.013339  0.299547 -0.220129 -0.333428
3     -0.006247 -0.442238 -0.713599  1.216152 -0.149945

In [47]:
hier_df.groupby(level='cty', axis =1 ).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

## 数据聚合

In [48]:
df

      data1     data2 key1 key2
0  0.999050 -0.094037    a  one
1  1.640705  0.587479    a  two
2 -1.202413  0.539482    b  one
3  1.517189  0.056848    b  two
4 -1.939885  0.142478    a  one

In [49]:
grouped = df.groupby('key1')

In [50]:
grouped

In [51]:
grouped['data1']

In [52]:
grouped['data1'].quantile(0.9)

key1
a    1.512374
b    1.245229
Name: data1, dtype: float64

In [53]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [54]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     3.580590  0.681516
b     2.719602  0.482634

In [55]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.233290  1.909175 -1.939885 -0.470417  0.999050  1.319878
b      2.0  0.157388  1.923049 -1.202413 -0.522512  0.157388  0.837288

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.640705   3.0  0.211973  0.346032 -0.094037  0.024221  0.142478
b     1.517189   2.0  0.298165  0.341274  0.056848  0.177507  0.298165


           75%       max
key1
a     0.364979  0.587479
b     0.418824  0.539482

In [56]:
! ll

/bin/sh: 1: ll: not found

In [57]:
! ls

arr.txt
chapter1_data.txt
comparison of NaN from numpy and None from Python.ipynb
contain_duplicate_columns.csv
df_to_df.ipynb
dual_test_npy.npz
foods-2011-10-03.json
Haiti.csv
how to use DataFrame.loc to select columns&rows assigned AND compare boolean.ipynb
joined_by_contain_duplicate_columns.csv
macrodata.csv
movies.dat
names
NaN_behavior_in_merge.ipynb
pandas_contain_duplicate_columns.ipynb
PortAuPrince_Roads
Python_data_analysis_chapter_1.ipynb
Python_data_analysis_chapter_2.ipynb
Python_data_analysis_chapter_3.ipynb
Python_data_analysis_chapter_4.ipynb
Python_data_analysis_chapter_6.ipynb
Python_data_analysis_chapter_7.ipynb
Python_data_analysis_chapter_8.ipynb
Python_data_analysis_chapter_9.ipynb
ratings.dat
README
spx.csv
test_npy.npy
three_shape1.svg
three_shape2.svg
tips.csv
users.dat

In [58]:
tips = pd.read_csv('tips.csv')

In [59]:
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [60]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [61]:
tips.head()

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

## 面向列的多函数应用

In [62]:
grouped = tips.groupby(['sex', 'smoker'])

In [63]:
grouped_pct = grouped['tip_pct']

In [64]:
grouped_pct.agg('mean')

sex     smoker
Female  No        0.156921
        Yes       0.182150
Male    No        0.160669
        Yes       0.152771
Name: tip_pct, dtype: float64

In [65]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                   mean       std  peak_to_peak
sex    smoker
Female No      0.156921  0.036421      0.195876
       Yes     0.182150  0.071595      0.360233
Male   No      0.160669  0.041849      0.220186
       Yes     0.152771  0.090588      0.674707

In [66]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                    foo       bar
sex    smoker
Female No      0.156921  0.036421
       Yes     0.182150  0.071595
Male   No      0.160669  0.041849
       Yes     0.152771  0.090588

In [67]:
funtions = 'count,mean,max'.split(',')

In [68]:
result = grouped['tip_pct', 'total_bill'].agg(funtions)

In [69]:
result

              tip_pct                     total_bill
                count      mean       max      count       mean    max
sex    smoker
Female No          54  0.156921  0.252672         54  18.105185  35.83
       Yes         33  0.182150  0.416667         33  17.977879  44.30
Male   No          97  0.160669  0.291990         97  19.791237  48.33
       Yes         60  0.152771  0.710345         60  22.284500  50.81

In [70]:
result['tip_pct']

               count      mean       max
sex    smoker
Female No         54  0.156921  0.252672
       Yes        33  0.182150  0.416667
Male   No         97  0.160669  0.291990
       Yes        60  0.152771  0.710345

In [71]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [72]:
grouped['tip_pct', 'total_bill'].agg(ftuples)

                   tip_pct              total_bill
              Durchschnitt Abweichung Durchschnitt Abweichung
sex    smoker
Female No         0.156921   0.001327    18.105185  53.092422
       Yes        0.182150   0.005126    17.977879  84.451517
Male   No         0.160669   0.001751    19.791237  76.152961
       Yes        0.152771   0.008206    22.284500  98.244673

### 对不同的列应用不同的函数

In [73]:
grouped.agg({'tip':np.max, 'size':'sum'})

                tip  size
sex    smoker
Female No       5.2   140
       Yes      6.5    74
Male   No       9.0   263
       Yes     10.0   150

In [74]:
grouped.agg({
    'tip_pct':'min,max,mean,std'.split(','),
    'size':'sum'
})

              size   tip_pct
               sum       min       max      mean       std
sex    smoker
Female No      140  0.056797  0.252672  0.156921  0.036421
       Yes      74  0.056433  0.416667  0.182150  0.071595
Male   No      263  0.071804  0.291990  0.160669  0.041849
       Yes     150  0.035638  0.710345  0.152771  0.090588

## 以“无索引”的形式返回聚合数据

In [75]:
tips.groupby('sex,smoker'.split(','), as_index = False).mean()

      sex smoker  total_bill       tip      size   tip_pct
0  Female     No   18.105185  2.773519  2.592593  0.156921
1  Female    Yes   17.977879  2.931515  2.242424  0.182150
2    Male     No   19.791237  3.113402  2.711340  0.160669
3    Male    Yes   22.284500  3.051167  2.500000  0.152771

# 分组级运算和转换

In [76]:
df

      data1     data2 key1 key2
0  0.999050 -0.094037    a  one
1  1.640705  0.587479    a  two
2 -1.202413  0.539482    b  one
3  1.517189  0.056848    b  two
4 -1.939885  0.142478    a  one

In [77]:
k1_means = df.groupby('key1').mean().add_prefix('mean_')

In [78]:
k1_means

      mean_data1  mean_data2
key1
a       0.233290    0.211973
b       0.157388    0.298165

In [79]:
pd.merge(df, k1_means, left_on='key1', right_index=True)

      data1     data2 key1 key2  mean_data1  mean_data2
0  0.999050 -0.094037    a  one    0.233290    0.211973
1  1.640705  0.587479    a  two    0.233290    0.211973
4 -1.939885  0.142478    a  one    0.233290    0.211973
2 -1.202413  0.539482    b  one    0.157388    0.298165
3  1.517189  0.056848    b  two    0.157388    0.298165

In [80]:
key = 'one,two,one,two,one'.split(',')

In [81]:
people

               a         b         c         d         e
Joe    -1.978465  1.153454 -0.038719  0.734191  0.405998
Steve  -0.353598 -1.040794 -1.265739  1.384710  0.719764
Wes     1.609915       NaN       NaN  0.578642  0.446704
Jim     0.182879 -2.079879 -0.141831 -1.372441 -0.425942
Travis -0.173727  2.653995 -0.516163  1.027742  0.234260

In [82]:
people.groupby(key).mean()

            a         b         c         d         e
one -0.180759  1.903724 -0.277441  0.780192  0.362321
two -0.085359 -1.560336 -0.703785  0.006134  0.146911

In [83]:
people.groupby(key).transform(np.mean)

               a         b         c         d         e
Joe    -0.180759  1.903724 -0.277441  0.780192  0.362321
Steve  -0.085359 -1.560336 -0.703785  0.006134  0.146911
Wes    -0.180759  1.903724 -0.277441  0.780192  0.362321
Jim    -0.085359 -1.560336 -0.703785  0.006134  0.146911
Travis -0.180759  1.903724 -0.277441  0.780192  0.362321

In [84]:
def demean(arr):
    return arr - arr.mean()

In [85]:
demeaned = people.groupby(key).transform(demean)

In [86]:
demeaned

               a         b         c         d         e
Joe    -1.797706 -0.750270  0.238722 -0.046001  0.043677
Steve  -0.268238  0.519543 -0.561954  1.378575  0.572853
Wes     1.790674       NaN       NaN -0.201549  0.084383
Jim     0.268238 -0.519543  0.561954 -1.378575 -0.572853
Travis  0.007032  0.750270 -0.238722  0.247551 -0.128060

In [87]:
demeaned.groupby(key).mean()

                a    b             c             d             e
one -2.775558e-17  0.0  1.387779e-17  1.480297e-16  5.551115e-17
two  0.000000e+00  0.0  0.000000e+00  0.000000e+00  0.000000e+00

## apply:一般性的拆分应用和合并

In [92]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [93]:
top(tips, n=6)

     total_bill   tip     sex smoker  day    time  size   tip_pct
109       14.31  4.00  Female    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39    Male     No  Sat  Dinner     2  0.291990
67         3.07  1.00  Female    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes  Sun  Dinner     2  0.710345

In [91]:
tips.head()

   total_bill   tip     sex smoker  day    time  size   tip_pct
0       16.99  1.01  Female     No  Sun  Dinner     2  0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3  0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3  0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2  0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4  0.146808

In [94]:
tips.groupby('smoker').apply(top)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [95]:
tips.groupby('smoker,day'.split(',')).apply(top, n=1, column='total_bill')

                 total_bill    tip     sex smoker   day    time  size  \
smoker day
No     Fri  94        22.75   3.25  Female     No   Fri  Dinner     2
       Sat  212       48.33   9.00    Male     No   Sat  Dinner     4
       Sun  156       48.17   5.00    Male     No   Sun  Dinner     6
       Thur 142       41.19   5.00    Male     No  Thur   Lunch     5
Yes    Fri  95        40.17   4.73    Male    Yes   Fri  Dinner     4
       Sat  170       50.81  10.00    Male    Yes   Sat  Dinner     3
       Sun  182       45.35   3.50    Male    Yes   Sun  Dinner     3
       Thur 197       43.11   5.00  Female    Yes  Thur   Lunch     4

                  tip_pct
smoker day
No     Fri  94   0.142857
       Sat  212  0.186220
       Sun  156  0.103799
       Thur 142  0.121389
Yes    Fri  95   0.117750
       Sat  170  0.196812
       Sun  182  0.077178
       Thur 197  0.115982

In [96]:
result = tips.groupby('smoker')['tip_pct'].describe()

In [102]:
result

,count,mean,std,min,25%,50%,75%,max
smoker,,,,,,,,
No,151.0,0.159328,0.039910,0.056797,0.136906,0.155625,0.185014,0.291990
Yes,93.0,0.163196,0.085119,0.035638,0.106771,0.153846,0.195059,0.710345

In [98]:
result.unstack('smoker')

       smoker
count  No        151.000000
       Yes        93.000000
mean   No          0.159328
       Yes         0.163196
std    No          0.039910
       Yes         0.085119
min    No          0.056797
       Yes         0.035638
25%    No          0.136906
       Yes         0.106771
50%    No          0.155625
       Yes         0.153846
75%    No          0.185014
       Yes         0.195059
max    No          0.291990
       Yes         0.710345
dtype: float64

In [101]:
result.unstack('smoker').unstack('smoker')

smoker          No        Yes
count   151.000000  93.000000
mean      0.159328   0.163196
std       0.039910   0.085119
min       0.056797   0.035638
25%       0.136906   0.106771
50%       0.155625   0.153846
75%       0.185014   0.195059
max       0.291990   0.710345

In [99]:
f = lambda x:x.describe()

In [100]:
grouped.apply(f)

                     total_bill        tip       size    tip_pct
sex    smoker
Female No     count   54.000000  54.000000  54.000000  54.000000
              mean    18.105185   2.773519   2.592593   0.156921
              std      7.286455   1.128425   1.073146   0.036421
              min      7.250000   1.000000   1.000000   0.056797
              25%     12.650000   2.000000   2.000000   0.139708
              50%     16.690000   2.680000   2.000000   0.149691
              75%     20.862500   3.437500   3.000000   0.181630
              max     35.830000   5.200000   6.000000   0.252672
       Yes    count   33.000000  33.000000  33.000000  33.000000
              mean    17.977879   2.931515   2.242424   0.182150
              std      9.189751   1.219916   0.613917   0.071595
              min      3.070000   1.000000   1.000000   0.056433
              25%     12.760000   2.000000   2.000000   0.152439
              50%     16.270000   2.880000   2.000000   0.173913
              75%     22.120000   3.500000   2.000000   0.198216
              max     44.300000   6.500000   4.000000   0.416667
Male   No     count   97.000000  97.000000  97.000000  97.000000
              mean    19.791237   3.113402   2.711340   0.160669
              std      8.726566   1.489559   0.989094   0.041849
              min      7.510000   1.250000   2.000000   0.071804
              25%     13.810000   2.000000   2.000000   0.131810
              50%     18.240000   2.740000   2.000000   0.157604
              75%     22.820000   3.710000   3.000000   0.186220
              max     48.330000   9.000000   6.000000   0.291990
       Yes    count   60.000000  60.000000  60.000000  60.000000
              mean    22.284500   3.051167   2.500000   0.152771
              std      9.911845   1.500120   0.892530   0.090588
              min      7.250000   1.000000   1.000000   0.035638
              25%     15.272500   2.000000   2.000000   0.101845
              50%     20.390000   3.000000   2.000000   0.141015
              75%     28.572500   3.820000   3.000000   0.191697
              max     50.810000  10.000000   5.000000   0.710345

## 禁止分组键

In [103]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip     sex smoker   day    time  size   tip_pct
88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

In [104]:
tips.groupby('smoker').apply(top)

            total_bill   tip     sex smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85    Male     No  Thur   Lunch     2  0.236746
       185       20.69  5.00    Male     No   Sun  Dinner     5  0.241663
       51        10.29  2.60  Female     No   Sun  Dinner     2  0.252672
       149        7.51  2.00    Male     No  Thur   Lunch     2  0.266312
       232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00  Female    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Male    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00  Female    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00  Female    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Male    Yes   Sun  Dinner     2  0.710345

## 分位数和桶分析

In [105]:
frame = DataFrame({
        'data1':np.random.randn(1000),
        'data2':np.random.randn(1000),
})

In [107]:
frame.head()

      data1     data2
0 -0.773288  1.313637
1  0.274176  0.065855
2 -0.937285  0.204540
3  3.559260 -0.757382
4  0.905283  0.718121

In [108]:
factor = pd.cut(frame.data1, 4)

In [111]:
factor.head()

0    (-2.114, -0.223]
1     (-0.223, 1.668]
2    (-2.114, -0.223]
3      (1.668, 3.559]
4     (-0.223, 1.668]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-4.013, -2.114] < (-2.114, -0.223] < (-0.223, 1.668] < (1.668, 3.559]]

In [112]:
def get_stats(group):
    return {
        'min':group.min(), 'max':group.max(),
        'count':group.count(), 'mean':group.mean()
    }

In [113]:
grouped = frame.data2.groupby(factor)

In [114]:
grouped

In [117]:
grouped1 = grouped.apply(get_stats)
grouped1

data1
(-4.013, -2.114]  count     19.000000
                  max        2.664174
                  mean       0.559221
                  min       -1.696209
(-2.114, -0.223]  count    389.000000
                  max        2.669489
                  mean      -0.002269
                  min       -2.968103
(-0.223, 1.668]   count    532.000000
                  max        3.322866
                  mean       0.027052
                  min       -2.961104
(1.668, 3.559]    count     60.000000
                  max        1.366887
                  mean      -0.230178
                  min       -2.333047
Name: data2, dtype: float64

In [118]:
grouped1.rename_axis(['data1', 'inner_index'])

data1             inner_index
(-4.013, -2.114]  count           19.000000
                  max              2.664174
                  mean             0.559221
                  min             -1.696209
(-2.114, -0.223]  count          389.000000
                  max              2.669489
                  mean            -0.002269
                  min             -2.968103
(-0.223, 1.668]   count          532.000000
                  max              3.322866
                  mean             0.027052
                  min             -2.961104
(1.668, 3.559]    count           60.000000
                  max              1.366887
                  mean            -0.230178
                  min             -2.333047
Name: data2, dtype: float64

In [119]:
grouped1.unstack()

                  count       max      mean       min
data1
(-4.013, -2.114]   19.0  2.664174  0.559221 -1.696209
(-2.114, -0.223]  389.0  2.669489 -0.002269 -2.968103
(-0.223, 1.668]   532.0  3.322866  0.027052 -2.961104
(1.668, 3.559]     60.0  1.366887 -0.230178 -2.333047

In [125]:
grouping = pd.qcut(frame.data1, 10, labels = False)

In [126]:
grouping.head()

0    2
1    6
2    1
3    9
4    8
Name: data1, dtype: int64

In [127]:
grouping = pd.qcut(frame.data1, 10)

In [129]:
grouping.head()

0     (-0.847, -0.53]
1      (0.259, 0.519]
2    (-1.263, -0.847]
3      (1.322, 3.559]
4       (0.84, 1.322]
Name: data1, dtype: category
Categories (10, interval[float64]): [(-4.007, -1.263] < (-1.263, -0.847] < (-0.847, -0.53] < (-0.53, -0.251] ... (0.259, 0.519] < (0.519, 0.84] < (0.84, 1.322] < (1.322, 3.559]]

In [130]:
grouped = frame.data2.groupby(grouping)

In [131]:
grouped

In [132]:
grouped.apply(get_stats)

data1
(-4.007, -1.263]  count    100.000000
                  max        2.664174
                  mean       0.126349
                  min       -2.292074
(-1.263, -0.847]  count    100.000000
                  max        2.397324
                  mean       0.040678
                  min       -2.007415
(-0.847, -0.53]   count    100.000000
                  max        2.380677
                  mean      -0.068717
                  min       -2.632056
(-0.53, -0.251]   count    100.000000
                  max        2.669489
                  mean      -0.030666
                  min       -2.968103
(-0.251, 0.0315]  count    100.000000
                  max        2.682684
                  mean      -0.043839
                  min       -1.865749
(0.0315, 0.259]   count    100.000000
                  max        2.241176
                  mean       0.108288
                  min       -2.391551
(0.259, 0.519]    count    100.000000
                  max        2.115313
                  mean      -0.043604
                  min       -2.498519
(0.519, 0.84]     count    100.000000
                  max        3.322866
                  mean      -0.001621
                  min       -2.794288
(0.84, 1.322]     count    100.000000
                  max        2.086364
                  mean       0.172444
                  min       -2.961104
(1.322, 3.559]    count    100.000000
                  max        2.633902
                  mean      -0.156076
                  min       -2.498664
Name: data2, dtype: float64

In [133]:
grouped.apply(get_stats).unstack()

                  count       max      mean       min
data1
(-4.007, -1.263]  100.0  2.664174  0.126349 -2.292074
(-1.263, -0.847]  100.0  2.397324  0.040678 -2.007415
(-0.847, -0.53]   100.0  2.380677 -0.068717 -2.632056
(-0.53, -0.251]   100.0  2.669489 -0.030666 -2.968103
(-0.251, 0.0315]  100.0  2.682684 -0.043839 -1.865749
(0.0315, 0.259]   100.0  2.241176  0.108288 -2.391551
(0.259, 0.519]    100.0  2.115313 -0.043604 -2.498519
(0.519, 0.84]     100.0  3.322866 -0.001621 -2.794288
(0.84, 1.322]     100.0  2.086364  0.172444 -2.961104
(1.322, 3.559]    100.0  2.633902 -0.156076 -2.498664

## 示例：用特定于分组的值填充缺失值

In [134]:
s = Series(np.random.randn(6))

In [135]:
s

0   -0.119769
1    1.634720
2   -0.557050
3   -0.317983
4    0.607688
5   -0.077004
dtype: float64

In [138]:
s[::2] = NA

In [139]:
s

0         NaN
1    1.634720
2         NaN
3   -0.317983
4         NaN
5   -0.077004
dtype: float64

In [140]:
s.fillna(s.mean())

0    0.413244
1    1.634720
2    0.413244
3   -0.317983
4    0.413244
5   -0.077004
dtype: float64

In [144]:
states = 'Ohio,New York,Vermont,Florida,Oregon,Nevada,California,Idaho'.split(',')

In [145]:
group_key = ['East'] * 4 + ['West'] * 4

In [146]:
data = Series(np.random.randn(8), index=states)

In [147]:
data

Ohio          0.453170
New York     -0.065638
Vermont      -0.619933
Florida       0.369855
Oregon       -0.243560
Nevada        0.127147
California   -1.055054
Idaho        -0.080726
dtype: float64

In [148]:
data['Vermont,Nevada,Idaho'.split(',')] = np.nan

In [149]:
data

Ohio          0.453170
New York     -0.065638
Vermont            NaN
Florida       0.369855
Oregon       -0.243560
Nevada             NaN
California   -1.055054
Idaho              NaN
dtype: float64

In [150]:
data.groupby(group_key).mean()

East    0.252463
West   -0.649307
dtype: float64

In [152]:
fill_mean = lambda g:g.fillna(g.mean())

In [153]:
data.groupby(group_key).apply(fill_mean)

Ohio          0.453170
New York     -0.065638
Vermont       0.252463
Florida       0.369855
Oregon       -0.243560
Nevada       -0.649307
California   -1.055054
Idaho        -0.649307
dtype: float64

In [154]:
data

Ohio          0.453170
New York     -0.065638
Vermont            NaN
Florida       0.369855
Oregon       -0.243560
Nevada             NaN
California   -1.055054
Idaho              NaN
dtype: float64

In [155]:
fill_values = {
    'East':0.5,
    'West':-1
}

In [156]:
fill_func = lambda g:g.fillna(fill_values[g.name])

In [157]:
data.groupby(group_key).apply(fill_func)

Ohio          0.453170
New York     -0.065638
Vermont       0.500000
Florida       0.369855
Oregon       -0.243560
Nevada       -1.000000
California   -1.055054
Idaho        -1.000000
dtype: float64

## 示例：随机采样和排列

In [158]:
suits = list('HSCD')

In [160]:
card_val = (list(range(1,11)) + [10]*3)*4

In [163]:
base_names = ['A'] + list(range(2, 11)) +list('JKQ')

In [164]:
base_names

['A', 2, 3, 4, 5, 6, 7, 8, 9, 10, 'J', 'K', 'Q']

In [165]:
cards  = []

In [167]:
for suit in list('HSCD'):
    cards.extend(str(num) + suit for num in base_names)
deck = Series(card_val, index=cards)

In [168]:
deck

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
AS      1
2S      2
3S      3
4S      4
5S      5
6S      6
7S      7
8S      8
9S      9
10S    10
JS     10
KS     10
QS     10
AC      1
2C      2
3C      3
4C      4
5C      5
6C      6
7C      7
8C      8
9C      9
10C    10
JC     10
KC     10
QC     10
AD      1
2D      2
3D      3
4D      4
5D      5
6D      6
7D      7
8D      8
9D      9
10D    10
JD     10
KD     10
QD     10
dtype: int64

In [185]:
def draw(deck, n=5):
    return deck.take(np.random.permutation(len(deck))[:n] )

In [187]:
draw(deck)

5S      5
4S      4
10D    10
10S    10
KD     10
dtype: int64

In [188]:
get_suit = lambda card:card[-1]

In [189]:
deck.groupby(get_suit).apply(draw, n=2)

C  7C      7
   4C      4
D  6D      6
   10D    10
H  JH     10
   10H    10
S  6S      6
   AS      1
dtype: int64

In [191]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

2C      2
7C      7
AD      1
10D    10
5H      5
JH     10
4S      4
QS     10
dtype: int64

## 示例：分组加权平均数和相关系数

In [192]:
df = DataFrame({
    'category':list('a'*4+'b'*4),
    'data':np.random.randn(8),
    'weights':np.random.randn(8)
})

In [193]:
df

  category      data   weights
0        a -1.751700  1.169088
1        a -0.222518  0.478498
2        a -0.851611 -0.406632
3        a -0.212275  0.159139
4        b -0.102189 -0.568136
5        b  0.596911  0.251110
6        b -1.293784 -0.387172
7        b  0.105142 -0.446348

In [194]:
grouped = df.groupby('category')

In [201]:
get_wavg = lambda g:np.average(g['data'],weights=g['weights'])

In [202]:
grouped.apply(get_wavg)

category
a   -1.315523
b   -0.575322
dtype: float64

In [203]:
close_px = pd.read_csv('stock_px.csv', parse_dates=True, index_col=0)

In [205]:
close_px.head()

            AAPL   MSFT    XOM     SPX
2003-01-02  7.40  21.11  29.22  909.03
2003-01-03  7.45  21.14  29.24  908.59
2003-01-06  7.45  21.52  29.96  929.01
2003-01-07  7.43  21.93  28.95  922.93
2003-01-08  7.28  21.31  28.83  909.93

In [206]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [207]:
close_px.pct_change()

                AAPL      MSFT       XOM       SPX
2003-01-02       NaN       NaN       NaN       NaN
2003-01-03  0.006757  0.001421  0.000684 -0.000484
2003-01-06  0.000000  0.017975  0.024624  0.022474
2003-01-07 -0.002685  0.019052 -0.033712 -0.006545
2003-01-08 -0.020188 -0.028272 -0.004145 -0.014086
2003-01-09  0.008242  0.029094  0.021159  0.019386
2003-01-10  0.002725  0.001824 -0.013927  0.000000
2003-01-13 -0.005435  0.008648 -0.004134 -0.001412
2003-01-14 -0.002732  0.010379  0.008993  0.005830
2003-01-15 -0.010959 -0.012506 -0.013713 -0.014426
2003-01-16  0.012465 -0.016282  0.004519 -0.003942
2003-01-17 -0.035568 -0.070345 -0.010381 -0.014017
2003-01-21 -0.005674 -0.002473 -0.023077 -0.015702
2003-01-22 -0.009986 -0.006445 -0.012885 -0.010432
2003-01-23  0.021614  0.024950 -0.002175  0.010224
2003-01-24 -0.026798 -0.046251 -0.021439 -0.029233
2003-01-27  0.024638 -0.013783 -0.026736 -0.016160
2003-01-28  0.031117 -0.007246  0.026326  0.013050
2003-01-29  0.024691  0.022419  0.036431  0.006779
2003-01-30 -0.041499 -0.033656 -0.018293 -0.022849
2003-01-31  0.002793 -0.015831  0.027768  0.013130
2003-02-03  0.020891  0.023056  0.013864  0.005399
2003-02-04 -0.004093 -0.025681  0.000000 -0.014088
2003-02-05 -0.010959 -0.007531 -0.014376 -0.005435
2003-02-06  0.000000  0.009756 -0.008538 -0.006449
2003-02-07 -0.020776 -0.017713 -0.007535 -0.010094
2003-02-10  0.015559  0.017486  0.007592  0.007569
2003-02-11  0.000000 -0.019871 -0.007176 -0.008098
2003-02-12  0.002786  0.000000 -0.019877 -0.012687
2003-02-13  0.009722  0.011507  0.012906 -0.001600
...              ...       ...       ...       ...
2011-09-02 -0.018319 -0.015643 -0.018370 -0.025282
2011-09-06  0.015212 -0.011240 -0.013723 -0.007436
2011-09-07  0.011034  0.019208  0.035137  0.028646
2011-09-08  0.000547  0.008462 -0.011270 -0.010612
2011-09-09 -0.017337 -0.018307 -0.024856 -0.026705
2011-09-12  0.006517  0.005828  0.011688  0.006966
2011-09-13  0.012318  0.005794 -0.002645  0.009120
2011-09-14  0.012168  0.017665  0.013817  0.013480
2011-09-15  0.009401  0.018491  0.018860  0.017187
2011-09-16  0.019188  0.004817  0.007296  0.005707
2011-09-19  0.027790  0.003319 -0.011402 -0.009803
2011-09-20  0.004421 -0.008453  0.004206 -0.001661
2011-09-21 -0.003168 -0.036694 -0.027564 -0.029390
2011-09-22 -0.025040 -0.035783 -0.037932 -0.031883
2011-09-23  0.006172  0.000000  0.001011  0.006082
2011-09-26 -0.002795  0.015164  0.034771  0.023336
2011-09-27 -0.009698  0.009041  0.016592  0.010688
2011-09-28 -0.005635 -0.003506 -0.011521 -0.020691
2011-09-29 -0.016221 -0.005082  0.025114  0.008114
2011-09-30 -0.023683 -0.022004 -0.016919 -0.024974
2011-10-03 -0.017623 -0.014464 -0.020377 -0.028451
2011-10-04 -0.005606  0.033021  0.023612  0.022488
2011-10-05  0.015436  0.021705  0.015378  0.017866
2011-10-06 -0.002327  0.017381 -0.000811  0.018304
2011-10-07 -0.020060 -0.003417 -0.004466 -0.008163
2011-10-10  0.051406  0.026286  0.036977  0.034125
2011-10-11  0.029526  0.002227 -0.000131  0.000544
2011-10-12  0.004747 -0.001481  0.011669  0.009795
2011-10-13  0.015515  0.008160 -0.010238 -0.002974
2011-10-14  0.033225  0.003311  0.022784  0.017380

[2214 rows x 4 columns]

In [208]:
rets = close_px.pct_change().dropna()

In [210]:
rets.head()

                AAPL      MSFT       XOM       SPX
2003-01-03  0.006757  0.001421  0.000684 -0.000484
2003-01-06  0.000000  0.017975  0.024624  0.022474
2003-01-07 -0.002685  0.019052 -0.033712 -0.006545
2003-01-08 -0.020188 -0.028272 -0.004145 -0.014086
2003-01-09  0.008242  0.029094  0.021159  0.019386

In [211]:
spx_corr = lambda x:x.corrwith(x['SPX'])

In [213]:
by_year = rets.groupby(lambda x:x.year)

In [215]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [216]:
by_year.apply(lambda g:g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

## 示例：面向分组的线性回归

In [219]:
import statsmodels.api as sm

/home/zhanghui/py35/lib/python3.5/site-packages/statsmodels/compat/pandas.py:56: FutureWarning: The pandas.core.datetools module is deprecated and will be removed in a future version. Please use the pandas.tseries module instead.
  from pandas.core import datetools

In [220]:
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1
    result = sm.OLS(Y, X).fit()
    return result.params

In [221]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

# 透视表和交叉表

In [222]:
tips

     total_bill   tip     sex smoker   day    time  size   tip_pct
0         16.99  1.01  Female     No   Sun  Dinner     2  0.059447
1         10.34  1.66    Male     No   Sun  Dinner     3  0.160542
2         21.01  3.50    Male     No   Sun  Dinner     3  0.166587
3         23.68  3.31    Male     No   Sun  Dinner     2  0.139780
4         24.59  3.61  Female     No   Sun  Dinner     4  0.146808
5         25.29  4.71    Male     No   Sun  Dinner     4  0.186240
6          8.77  2.00    Male     No   Sun  Dinner     2  0.228050
7         26.88  3.12    Male     No   Sun  Dinner     4  0.116071
8         15.04  1.96    Male     No   Sun  Dinner     2  0.130319
9         14.78  3.23    Male     No   Sun  Dinner     2  0.218539
10        10.27  1.71    Male     No   Sun  Dinner     2  0.166504
11        35.26  5.00  Female     No   Sun  Dinner     4  0.141804
12        15.42  1.57    Male     No   Sun  Dinner     2  0.101816
13        18.43  3.00    Male     No   Sun  Dinner     4  0.162778
14        14.83  3.02  Female     No   Sun  Dinner     2  0.203641
15        21.58  3.92    Male     No   Sun  Dinner     2  0.181650
16        10.33  1.67  Female     No   Sun  Dinner     3  0.161665
17        16.29  3.71    Male     No   Sun  Dinner     3  0.227747
18        16.97  3.50  Female     No   Sun  Dinner     3  0.206246
19        20.65  3.35    Male     No   Sat  Dinner     3  0.162228
20        17.92  4.08    Male     No   Sat  Dinner     2  0.227679
21        20.29  2.75  Female     No   Sat  Dinner     2  0.135535
22        15.77  2.23  Female     No   Sat  Dinner     2  0.141408
23        39.42  7.58    Male     No   Sat  Dinner     4  0.192288
24        19.82  3.18    Male     No   Sat  Dinner     2  0.160444
25        17.81  2.34    Male     No   Sat  Dinner     4  0.131387
26        13.37  2.00    Male     No   Sat  Dinner     2  0.149589
27        12.69  2.00    Male     No   Sat  Dinner     2  0.157604
28        21.70  4.30    Male     No   Sat  Dinner     2  0.198157
29        19.65  3.00  Female     No   Sat  Dinner     2  0.152672
..          ...   ...     ...    ...   ...     ...   ...       ...
214       28.17  6.50  Female    Yes   Sat  Dinner     3  0.230742
215       12.90  1.10  Female    Yes   Sat  Dinner     2  0.085271
216       28.15  3.00    Male    Yes   Sat  Dinner     5  0.106572
217       11.59  1.50    Male    Yes   Sat  Dinner     2  0.129422
218        7.74  1.44    Male    Yes   Sat  Dinner     2  0.186047
219       30.14  3.09  Female    Yes   Sat  Dinner     4  0.102522
220       12.16  2.20    Male    Yes   Fri   Lunch     2  0.180921
221       13.42  3.48  Female    Yes   Fri   Lunch     2  0.259314
222        8.58  1.92    Male    Yes   Fri   Lunch     1  0.223776
223       15.98  3.00  Female     No   Fri   Lunch     3  0.187735
224       13.42  1.58    Male    Yes   Fri   Lunch     2  0.117735
225       16.27  2.50  Female    Yes   Fri   Lunch     2  0.153657
226       10.09  2.00  Female    Yes   Fri   Lunch     2  0.198216
227       20.45  3.00    Male     No   Sat  Dinner     4  0.146699
228       13.28  2.72    Male     No   Sat  Dinner     2  0.204819
229       22.12  2.88  Female    Yes   Sat  Dinner     2  0.130199
230       24.01  2.00    Male    Yes   Sat  Dinner     4  0.083299
231       15.69  3.00    Male    Yes   Sat  Dinner     3  0.191205
232       11.61  3.39    Male     No   Sat  Dinner     2  0.291990
233       10.77  1.47    Male     No   Sat  Dinner     2  0.136490
234       15.53  3.00    Male    Yes   Sat  Dinner     2  0.193175
235       10.07  1.25    Male     No   Sat  Dinner     2  0.124131
236       12.60  1.00    Male    Yes   Sat  Dinner     2  0.079365
237       32.83  1.17    Male    Yes   Sat  Dinner     2  0.035638
238       35.83  4.67  Female     No   Sat  Dinner     3  0.130338
239       29.03  5.92    Male     No   Sat  Dinner     3  0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2  0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2  0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2  0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2  0.159744

[244 rows x 8 columns]

In [225]:
tips.pivot_table(index=['sex','smoker'])

                   size       tip   tip_pct  total_bill
sex    smoker
Female No      2.592593  2.773519  0.156921   18.105185
       Yes     2.242424  2.931515  0.182150   17.977879
Male   No      2.711340  3.113402  0.160669   19.791237
       Yes     2.500000  3.051167  0.152771   22.284500

In [228]:
tips.pivot_table('tip_pct,size'.split(','), index='sex,day'.split(','), columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
sex    day
Female Fri   2.500000  2.000000  0.165296  0.209129
       Sat   2.307692  2.200000  0.147993  0.163817
       Sun   3.071429  2.500000  0.165710  0.237075
       Thur  2.480000  2.428571  0.155971  0.163073
Male   Fri   2.000000  2.125000  0.138005  0.144730
       Sat   2.656250  2.629630  0.162132  0.139067
       Sun   2.883721  2.600000  0.158291  0.173964
       Thur  2.500000  2.300000  0.165706  0.164417

In [229]:
tips.pivot_table('tip_pct,size'.split(','), index='sex,day'.split(','), columns='smoker', margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
sex    day
Female Fri   2.500000  2.000000  2.111111  0.165296  0.209129  0.199388
       Sat   2.307692  2.200000  2.250000  0.147993  0.163817  0.156470
       Sun   3.071429  2.500000  2.944444  0.165710  0.237075  0.181569
       Thur  2.480000  2.428571  2.468750  0.155971  0.163073  0.157525
Male   Fri   2.000000  2.125000  2.100000  0.138005  0.144730  0.143385
       Sat   2.656250  2.629630  2.644068  0.162132  0.139067  0.151577
       Sun   2.883721  2.600000  2.810345  0.158291  0.173964  0.162344
       Thur  2.500000  2.300000  2.433333  0.165706  0.164417  0.165276
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [230]:
tips.pivot_table('tip_pct', index='sex,smoker'.split(','), columns='day',aggfunc=len, margins=True)

day             Fri   Sat   Sun  Thur    All
sex    smoker
Female No       2.0  13.0  14.0  25.0   54.0
       Yes      7.0  15.0   4.0   7.0   33.0
Male   No       2.0  32.0  43.0  20.0   97.0
       Yes      8.0  27.0  15.0  10.0   60.0
All            19.0  87.0  76.0  62.0  244.0

## 交叉表

In [231]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244

## 2012年联邦选举委员会数据库

In [232]:
fec = pd.read_csv('P00000001-ALL.csv')

/home/zhanghui/py35/lib/python3.5/site-packages/IPython/core/interactiveshell.py:2683: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [234]:
fec

,cmte_id,cand_id,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_zip,contbr_employer,contbr_occupation,contb_receipt_amt,contb_receipt_dt,receipt_desc,memo_cd,memo_text,form_tp,file_num
0,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,3.6601e+08,RETIRED,RETIRED,250.0,20-JUN-11,NaN,NaN,NaN,SA17A,736166
1,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,3.6601e+08,RETIRED,RETIRED,50.0,23-JUN-11,NaN,NaN,NaN,SA17A,736166
2,C00410118,P20002978,"Bachmann, Michelle","SMITH, LANIER",LANETT,AL,3.68633e+08,INFORMATION REQUESTED,INFORMATION REQUESTED,250.0,05-JUL-11,NaN,NaN,NaN,SA17A,749073
3,C00410118,P20002978,"Bachmann, Michelle","BLEVINS, DARONDA",PIGGOTT,AR,7.24548e+08,NONE,RETIRED,250.0,01-AUG-11,NaN,NaN,NaN,SA17A,749073
4,C00410118,P20002978,"Bachmann, Michelle","WARDENBURG, HAROLD",HOT SPRINGS NATION,AR,7.19016e+08,NONE,RETIRED,300.0,20-JUN-11,NaN,NaN,NaN,SA17A,736166
5,C00410118,P20002978,"Bachmann, Michelle","BECKMAN, JAMES",SPRINGDALE,AR,7.27647e+08,NONE,RETIRED,500.0,23-JUN-11,NaN,NaN,NaN,SA17A,736166
6,C00410118,P20002978,"Bachmann, Michelle","BLEVINS, DARONDA",PIGGOTT,AR,7.24548e+08,INFORMATION REQUESTED,INFORMATION REQUESTED,250.0,21-JUN-11,NaN,NaN,NaN,SA17A,736166
7,C00410118,P20002978,"Bachmann, Michelle","BLEVINS, DARONDA",PIGGOTT,AR,7.24548e+08,NONE,RETIRED,250.0,05-JUL-11,NaN,NaN,NaN,SA17A,749073
8,C00410118,P20002978,"Bachmann, Michelle","COLLINS, SARAH",MESA,AZ,8.52107e+08,ST. JOSEPH HOSPITAL,RN,250.0,21-JUN-11,NaN,NaN,NaN,SA17A,736166
9,C00410118,P20002978,"Bachmann, Michelle","COLEMAN, RONALD",TUCSON,AZ,8.57499e+08,RAYTHEON,ELECTRICAL ENGINEER,250.0,20-JUN-11,NaN,NaN,NaN,SA17A,736166
10,C00410118,P20002978,"Bachmann, Michelle","ATCHLEY, JR, KEITH",MESA,AZ,85215,NONE,RETIRED,250.0,22-JUN-11,NaN,NaN,NaN,SA17A,736166
11,C00410118,P20002978,"Bachmann, Michelle","FARNSWORTH, ROSS",MESA,AZ,8.52062e+08,FARNSWORTH COMPANIES,LAND DEVELOPER,500.0,22-JUN-11,NaN,NaN,NaN,SA17A,736166
12,C00410118,P20002978,"Bachmann, Michelle","PRESTON, CLIFFORD",ORO VALLEY,AZ,8.57379e+08,INFORMATION REQUESTED,INFORMATION REQUESTED,250.0,21-JUN-11,NaN,NaN,NaN,SA17A,736166
13,C00410118,P20002978,"Bachmann, Michelle","PETERSEN, W",GILBERT,AZ,85295,INFORMATION REQUESTED,INFORMATION REQUESTED,250.0,27-JUN-11,NaN,NaN,NaN,SA17A,736166
14,C00410118,P20002978,"Bachmann, Michelle","MILLER, WILLIAM",SCOTTSDALE,AZ,8.52513e+08,INFORMATION REQUESTED,INFORMATION REQUESTED,250.0,11-JUL-11,NaN,NaN,NaN,SA17A,749073
15,C00410118,P20002978,"Bachmann, Michelle","DOLAN, WILLIAM",PHOENIX,AZ,8.50145e+08,VA MEDICAL CENTER,PHYSICIAN,300.0,08-JUL-11,NaN,NaN,NaN,SA17A,749073
16,C00410118,P20002978,"Bachmann, Michelle","WILSON, RICHARD",FLAGSTAFF,AZ,8.60011e+08,NONE,RETIRED,500.0,17-JUN-11,NaN,NaN,NaN,SA17A,736166
17,C00410118,P20002978,"Bachmann, Michelle","REULING, RICHARD",GREEN VALLEY,AZ,8.56225e+08,NONE,RETIRED,1000.0,05-JUL-11,NaN,NaN,NaN,SA17A,749073
18,C00410118,P20002978,"Bachmann, Michelle","ALLUMBAUGH, KATHY",SANTA ANA,CA,9.27051e+08,NONE,RETIRED,250.0,13-JUN-11,NaN,NaN,NaN,SA17A,736166
19,C00410118,P20002978,"Bachmann, Michelle","DEL POZO, JOSE",DEL MAR,CA,9.20143e+08,RETIRES,RETIRED,300.0,16-JUN-11,NaN,NaN,NaN,SA17A,736166
20,C00410118,P20002978,"Bachmann, Michelle","KIEFFER, PIERRE",SACRAMENTO,CA,9.58257e+08,SELF,OFFICE FURNITURE BROKER,500.0,16-JUN-11,NaN,NaN,NaN,SA17A,736166
21,C00410118,P20002978,"Bachmann, Michelle","HANNAH, STEPHEN",SHERMAN OAKS,CA,9.14132e+08,RETIRED,RETIRED,250.0,16-JUN-11,NaN,NaN,NaN,SA17A,736166
22,C00410118,P20002978,"Bachmann, Michelle","MINNIS, RITA",MILPITAS,CA,9.50358e+08,MILPITS MATERIALS,MANAGER,2500.0,17-JUN-11,NaN,NaN,NaN,SA17A,736166
23,C00410118,P20002978,"Bachmann, Michelle","MINNIS, RITA",MILPITAS,CA,9.50358e+08,MILPITS MATERIALS,MANAGER,2500.0,17-JUN-11,NaN,NaN,NaN,SA17A,736166
24,C00410118,P20002978,"Bachmann, Michelle","EDWARDS, MARK",LA JOLLA,CA,9.20378e+08,NONE,RETIRED,150.0,05-AUG-11,NaN,NaN,NaN,SA17A,749073
25,C00410118,P20002978,"Bachmann, Michelle","HANNAH, STEPHEN",SHERMAN OAKS,CA,9.14132e+08,NONE,RETIRED,200.0,08-AUG-11,NaN,NaN,NaN,SA17A,749073
26,C00410118,P20002978,"Bachmann, Michelle","HENRY, JOAN",YUBA CITY,CA,9.59939e+08,NONE,RETIRED,100.0,15-AUG-11,NaN,NaN,NaN,SA17A,749073
27,C00410118,P20002978,"Bachmann, Michelle","SKEREN, THOMAS",CALABASAS,CA,9.13022e+08,INFORMATION REQUESTED,INFORMATION REQUESTED,250.0,16-AUG-11,NaN,NaN,NaN,SA17A,749073
28,C00410118,P20002978,"Bachmann, Michelle","EDWARDS, WILLIAM",LOS ANGELES,CA,9.00243e+08,INFORMATION REQUESTED,INFORMATION REQUESTED,500.0,18-AUG-11,NaN,NaN,NaN,SA17A,749073
29,C00410118,P20002978,"Bachmann, Michelle","PORTER, NANCY",CARMEL VALLEY,CA,9.39249e+08,NANCY PORTER,REALTOR,250.0,05-JUL-11,NaN,NaN,NaN,SA17A,749073
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1001701,C00500587,P20003281,"Perry, Rick","NELSON, DEBORAH MRS.",MORGANTOWN,WV,265082541,HOMEMAKER,HOMEMAKER,2500.0,01-OCT-11,REATTRIBUTION FROM SPOUSE,X,REATTRIBUTION FROM SPOUSE,SA17A,772060
1001702,C00500587,P20003281,"Perry, Rick","PHILLIPS, JIMMY D. MR.",BECKLEY,WV,258011601,PHILLIPS MACHINE SERVICES,EXECUTIVE,2500.0,28-NOV-11,REDESIGNATION FROM PRIMARY,X,REDESIGNATION FROM PRIMARY,SA17A,772060
1001703,C00500587,P20003281,"Perry, Rick","NELSON, HOWARD L. MR.",MORGANTOWN,WV,265082541,SWANSON INDUSTRIES,C.F.O.,-2500.0,01-OCT-11,REATTRIBUTION TO SPOUSE,X,REATTRIBUTION TO SPOUSE,SA17A,772060
1001704,C00500587,P20003281,"Perry, Rick","PHILLIPS, JIMMY D. MR.",BECKLEY,WV,258011601,PHILLIPS MACHINE SERVICES,EXECUTIVE,-2500.0,28-NOV-11,REDESIGNATION TO GENERAL,X,REDESIGNATION TO GENERAL,SA17A,772060
1001705,C00500587,P20003281,"Perry, Rick","PATTON, CHARLES R. MR.",CHARLESTON,WV,253142370,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,1000.0,17-NOV-11,NaN,NaN,NaN,SA17A,772060
1001706,C00500587,P20003281,"Perry, Rick","BEVILOCK, DEBBIE S. MRS.",GRAFTON,WV,263549332,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,2500.0,08-OCT-11,REATTRIBUTION FROM SPOUSE,X,REATTRIBUTION FROM SPOUSE,SA17A,772060
1001707,C00500587,P20003281,"Perry, Rick","BEVILOCK, JOHN C. MR.",GRAFTON,WV,263549332,DAVID STANLEY COMPANY,SALES,-2500.0,08-OCT-11,REATTRIBUTION TO SPOUSE,X,REATTRIBUTION TO SPOUSE,SA17A,772060
1001708,C00500587,P20003281,"Perry, Rick","HAYHURST, CYNTHIA L. MRS.",WHEELING,WV,260035764,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,2500.0,09-OCT-11,REATTRIBUTION FROM SPOUSE,X,REATTRIBUTION FROM SPOUSE,SA17A,772060
1001709,C00500587,P20003281,"Perry, Rick","HAYHURST, JAMES W. MR.",WHEELING,WV,260035764,DAVID STANLEY COMPANY,SALES,-2500.0,09-OCT-11,REATTRIBUTION TO SPOUSE,X,REATTRIBUTION TO SPOUSE,SA17A,772060
1001710,C00500587,P20003281,"Perry, Rick","PHILLIPS, JIMMY",BECKLEY,WV,25801,NaN,NaN,-2500.0,31-MAR-12,Refund,NaN,GENERAL REFUND,SB28A,779144
1001711,C00500587,P20003281,"Perry, Rick","FRIESS, STEPHEN MR.",JACKSON,WY,830021655,FRIESS INC.,CONSULTANT,1000.0,29-SEP-11,NaN,NaN,NaN,SA17A,751678
1001712,C00500587,P20003281,"Perry, Rick","SUGDEN, RICHARD G. MR.",JACKSON,WY,830010489,FAMILY PRACTICE ASSOCIATES,DOCTOR,2500.0,26-AUG-11,NaN,NaN,NaN,SA17A,751678
1001713,C00500587,P20003281,"Perry, Rick","SUGDEN, SUSAN MRS.",JACKSON,WY,830010489,SELF-EMPLOYED,INVESTOR,2500.0,26-AUG-11,NaN,NaN,NaN,SA17A,751678
1001714,C00500587,P20003281,"Perry, Rick","SPENCE, RUSSELL",RIVERTON,WY,825019711,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,250.0,15-AUG-11,NaN,NaN,NaN,SA17A,751678
1001715,C00500587,P20003281,"Perry, Rick",TEXAS ENERGY L.L.C.,CHEYENNE,WY,820013163,NaN,NaN,250.0,30-SEP-11,NaN,NaN,ATTRIBUTION TO PARTNERS REQUESTED,SA17A,751678
1001716,C00500587,P20003281,"Perry, Rick","KINSEY, JOAN",LARAMIE,WY,820709758,RETIRED,RETIRED,1000.0,17-AUG-11,NaN,NaN,NaN,SA17A,751678
1001717,C00500587,P20003281,"Perry, Rick","HARDER, ROBERT",POWELL,WY,824359238,NaN,RETIRED,100.0,12-NOV-11,NaN,NaN,NaN,SA17A,772060
1001718,C00500587,P20003281,"Perry, Rick","LUCAS, WES",TETON VILLAGE,WY,83025,SIRVA,CEO,2500.0,04-OCT-11,NaN,NaN,NaN,SA17A,772060
1001719,C00500587,P20003281,"Perry, Rick","LUCAS, ELISABET",TETON VILLAGE,WY,830250824,LUCAS PROPERTIES,OWNER,2500.0,04-OCT-11,NaN,NaN,NaN,SA17A,772060
1001720,C00500587,P20003281,"Perry, Rick","HARDER, ROBERT",POWELL,WY,824359238,NaN,RETIRED,100.0,01-OCT-11,NaN,NaN,NaN,SA17A,772060
1001721,C00500587,P20003281,"Perry, Rick","HANSEN, STEVE MR.",CHEYENNE,WY,820013163,TEXAS ENERGY LLC,EXECUTIVE,250.0,15-NOV-11,NaN,X,SEE ATTRIBUTION,SA17A,772060
1001722,C00500587,P20003281,"Perry, Rick","HARDER, ROBERT",POWELL,WY,824359238,NaN,RETIRED,100.0,29-OCT-11,NaN,NaN,NaN,SA17A,772060
1001723,C00500587,P20003281,"Perry, Rick","HARDER, ROBERT",POWELL,WY,824359238,NaN,RETIRED,100.0,30-NOV-11,NaN,NaN,NaN,SA17A,772060
1001724,C00500587,P20003281,"Perry, Rick","HEFFERNAN, JILL PRINCE MRS.",INFO REQUESTED,XX,99999,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,500.0,30-SEP-11,NaN,NaN,NaN,SA17A,751678
1001725,C00500587,P20003281,"Perry, Rick","ELWOOD, MIKE MR.",INFO REQUESTED,XX,99999,AM COAL,ENGINEER,2500.0,30-SEP-11,NaN,NaN,NaN,SA17A,751678
1001726,C00500587,P20003281,"Perry, Rick","GORMAN, CHRIS D. MR.",INFO REQUESTED,XX,99999,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,5000.0,29-SEP-11,REATTRIBUTION / REDESIGNATION REQUESTED (AUTOM...,NaN,REATTRIBUTION / REDESIGNATION REQUESTED (AUTOM...,SA17A,751678
1001727,C00500587,P20003281,"Perry, Rick","DUFFY, DAVID A. MR.",INFO REQUESTED,XX,99999,DUFFY EQUIPMENT COMPANY INC.,BUSINESS OWNER,2500.0,30-SEP-11,NaN,NaN,NaN,SA17A,751678
1001728,C00500587,P20003281,"Perry, Rick","GRANE, BRYAN F. MR.",INFO REQUESTED,XX,99999,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,500.0,29-SEP-11,NaN,NaN,NaN,SA17A,751678
1001729,C00500587,P20003281,"Perry, Rick","TOLBERT, DARYL MR.",INFO REQUESTED,XX,99999,T.A.C.C.,LONGWALL MAINTENANCE FOREMAN,500.0,30-SEP-11,NaN,NaN,NaN,SA17A,751678
1001730,C00500587,P20003281,"Perry, Rick","ANDERSON, MARILEE MRS.",INFO REQUESTED,XX,99999,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,2500.0,31-AUG-11,NaN,NaN,NaN,SA17A,751678

In [236]:
fec.ix[123456]

cmte_id                             C00431445
cand_id                             P80003338
cand_nm                         Obama, Barack
contbr_nm                         ELLMAN, IRA
contbr_city                             TEMPE
contbr_st                                  AZ
contbr_zip                          852816719
contbr_employer      ARIZONA STATE UNIVERSITY
contbr_occupation                   PROFESSOR
contb_receipt_amt                          50
contb_receipt_dt                    01-DEC-11
receipt_desc                              NaN
memo_cd                                   NaN
memo_text                                 NaN
form_tp                                 SA17A
file_num                               772372
Name: 123456, dtype: object

In [237]:
unique_cards = fec.cand_nm.unique()

In [238]:
unique_cards

array(['Bachmann, Michelle', 'Romney, Mitt', 'Obama, Barack',
       "Roemer, Charles E. 'Buddy' III", 'Pawlenty, Timothy',
       'Johnson, Gary Earl', 'Paul, Ron', 'Santorum, Rick', 'Cain, Herman',
       'Gingrich, Newt', 'McCotter, Thaddeus G', 'Huntsman, Jon',
       'Perry, Rick'], dtype=object)

In [241]:
parties = {
    'Bachmann, Michelle':'Republican',
    'Romney, Mitt':'Republican',
    'Obama, Barack':'Democrat',
       "Roemer, Charles E. 'Buddy' III":'Democrat',
    'Pawlenty, Timothy':'Republican',
       'Johnson, Gary Earl':'Republican',
    'Paul, Ron':'Republican',
    'Santorum, Rick':'Republican',
    'Cain, Herman':'Republican',
       'Gingrich, Newt':'Republican',
    'McCotter, Thaddeus G':'Republican', 
    'Huntsman, Jon':'Republican',
       'Perry, Rick':'Democrat'
}

In [242]:
fec.cand_nm[123456:123461].map(parties)

123456    Democrat
123457    Democrat
123458    Democrat
123459    Democrat
123460    Democrat
Name: cand_nm, dtype: object

In [243]:
fec['party'] = fec.cand_nm.map(parties)

In [244]:
fec['party'].value_counts()

Democrat      613241
Republican    388490
Name: party, dtype: int64

In [247]:
(fec.contb_receipt_amt>0).value_counts()

True     991475
False     10256
Name: contb_receipt_amt, dtype: int64

In [248]:
fec = fec[fec.contb_receipt_amt>0]

In [251]:
fec_mrbo = fec[fec.cand_nm.isin(['Obama, Barack','Romney, Mitt'])]

In [252]:
fec_mrbo

,cmte_id,cand_id,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_zip,contbr_employer,contbr_occupation,contb_receipt_amt,contb_receipt_dt,receipt_desc,memo_cd,memo_text,form_tp,file_num,party
411,C00431171,P80003353,"Romney, Mitt","ELDERBAUM, WILLIAM",DPO,AA,3.4023e+08,US GOVERNMENT,FOREIGN SERVICE OFFICER,25.0,01-FEB-12,NaN,NaN,NaN,SA17A,780124,Republican
412,C00431171,P80003353,"Romney, Mitt","ELDERBAUM, WILLIAM",DPO,AA,3.4023e+08,US GOVERNMENT,FOREIGN SERVICE OFFICER,110.0,01-FEB-12,NaN,NaN,NaN,SA17A,780124,Republican
413,C00431171,P80003353,"Romney, Mitt","CARLSEN, RICHARD",APO,AE,9.128e+07,DEFENSE INTELLIGENCE AGENCY,INTELLIGENCE ANALYST,250.0,13-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
414,C00431171,P80003353,"Romney, Mitt","DELUCA, PIERRE",APO,AE,9.128e+07,CISCO,ENGINEER,30.0,21-AUG-11,NaN,NaN,NaN,SA17A,760261,Republican
415,C00431171,P80003353,"Romney, Mitt","SARGENT, MICHAEL",APO,AE,9.01201e+07,RAYTHEON TECHNICAL SERVICES CORP,COMPUTER SYSTEMS ENGINEER,100.0,07-MAR-12,NaN,NaN,NaN,SA17A,780128,Republican
416,C00431171,P80003353,"Romney, Mitt","WILSON, ANDREW C. MR.",DPO,AE,9.87e+07,US DEPT OF STATE,FOREIGN SERVICE OFFICER,50.0,17-MAR-12,NaN,NaN,NaN,SA17A,780128,Republican
417,C00431171,P80003353,"Romney, Mitt","GRIFFIS, JOHN",APO,AE,9.128e+07,US ARMY,MILITARY OFFICER,250.0,20-MAR-12,NaN,NaN,NaN,SA17A,780128,Republican
418,C00431171,P80003353,"Romney, Mitt","SARGENT, MICHAEL",APO,AE,9.01201e+07,RAYTHEON TECHNICAL SERVICES CORP,COMPUTER SYSTEMS ENGINEER,100.0,09-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
419,C00431171,P80003353,"Romney, Mitt","GRIFFIS, JOHN",APO,AE,9.128e+07,US ARMY,MILITARY OFFICER,250.0,28-JAN-12,NaN,NaN,NaN,SA17A,771933,Republican
420,C00431171,P80003353,"Romney, Mitt","DELUCA, PIERRE MR.",APO,AE,9.128e+07,US ARMY,ENGINEER,50.0,01-FEB-12,NaN,NaN,NaN,SA17A,780124,Republican
421,C00431171,P80003353,"Romney, Mitt","CLAUDE, FOUKS",PARIS FRANCE,AE,75011,PALPATINE,SECRET,100.0,29-NOV-11,NaN,NaN,NaN,SA17A,771927,Republican
422,C00431171,P80003353,"Romney, Mitt","CLAUDE, FOUKS",PARIS FRANCE,AE,75011,PALPATINE,SECRET,250.0,29-DEC-11,NaN,NaN,NaN,SA17A,771927,Republican
423,C00431171,P80003353,"Romney, Mitt","JONES, BRENDON",QATAR,AE,9898,OSC,MEDIA ANALYST,250.0,22-NOV-11,NaN,NaN,NaN,SA17A,771927,Republican
424,C00431171,P80003353,"Romney, Mitt","KAMMER, DONALD",APO,AE,9267,US,MILITARY,500.0,31-DEC-11,NaN,NaN,NaN,SA17A,771927,Republican
425,C00431171,P80003353,"Romney, Mitt","DELUCA, PIERRE",APO,AE,9.128e+07,CISCO,ENGINEER,250.0,28-APR-11,NaN,NaN,NaN,SA17A,760248,Republican
426,C00431171,P80003353,"Romney, Mitt","DELUCA, PIERRE",APO,AE,9.128e+07,CISCO,ENGINEER,250.0,27-JUN-11,NaN,NaN,NaN,SA17A,760248,Republican
427,C00431171,P80003353,"Romney, Mitt","EDWARDS, BRYANT MR.",LONDON UK,AE,90071,LATHAM & WATKINS,ATTORNEY,2500.0,20-JUN-11,NaN,NaN,NaN,SA17A,760248,Republican
428,C00431171,P80003353,"Romney, Mitt","SANTALIZ, RAFAEL MR. JR.",APO,AE,9.102e+07,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,500.0,14-FEB-12,NaN,NaN,NaN,SA17A,780124,Republican
429,C00431171,P80003353,"Romney, Mitt","DICKSON, ROBERT J. MR.",ANCHORAGE,AK,9.95166e+08,ATKINSON CONWAY & GOGVOR,ATTORNEY,250.0,27-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
430,C00431171,P80003353,"Romney, Mitt","CARROLL, ART MR.",FAIRBANKS,AK,9.97014e+08,RETIRED,RETIRED,100.0,09-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
431,C00431171,P80003353,"Romney, Mitt","NELDNER, RICHARD E. MR.",FAIRBANKS,AK,9.97073e+08,RETIRED,RETIRED,2500.0,23-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
432,C00431171,P80003353,"Romney, Mitt","MCGUIRE, PATTI S. MRS.",ANCHORAGE,AK,9.95022e+08,BRIDGECARE HOSPITALS,VICE PRESIDENT,1000.0,12-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
433,C00431171,P80003353,"Romney, Mitt","WENZELL, DOMINIC S. DR.",ANCHORAGE,AK,9.95173e+08,SELF-EMPLOYED,DENTIST,250.0,30-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
434,C00431171,P80003353,"Romney, Mitt","DIXON, JANET",FAIRBANKS,AK,9.97097e+08,SELF-EMPLOYED,CONSULTANT,110.0,23-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
435,C00431171,P80003353,"Romney, Mitt","HOVE, BRIAN MR.",ANCHORAGE,AK,9.95173e+08,SELF-EMPLOYED,PHOTOGRAPHER,250.0,24-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
436,C00431171,P80003353,"Romney, Mitt","FRAHM, MIKE",WILLOW,AK,9.96881e+08,ALASKA AIRLINES,PILOT,250.0,20-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
437,C00431171,P80003353,"Romney, Mitt","POWERS, SANDRA L.",ANCHORAGE,AK,9.95072e+08,POWERS BROTHERS INC.,VICE PRESIDENT,25.0,24-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
438,C00431171,P80003353,"Romney, Mitt","SNODGRASS, JEANNIE",PALMER,AK,9.96452e+08,STUDENT,STUDENT,250.0,21-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
439,C00431171,P80003353,"Romney, Mitt","POWELL, J. FRANCES MR.",KODIAK,AK,9.96151e+08,INFORMATION REQUESTED PER BEST EFFORTS,INFORMATION REQUESTED PER BEST EFFORTS,250.0,09-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
440,C00431171,P80003353,"Romney, Mitt","MCQUEEN, DENNIS L. MR.",FAIRBANKS,AK,9.97012e+08,RETIRED,RETIRED,50.0,16-APR-12,NaN,NaN,NaN,SA17A,785689,Republican
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
701356,C00431445,P80003338,"Obama, Barack","WOODS, WILLIAM",BAR NUNN,WY,826019485,WAL-MART,ASSOCIATE,20.0,31-MAR-12,NaN,NaN,NaN,SA17A,780234,Democrat
701357,C00431445,P80003338,"Obama, Barack","STOVAL, LINDA",CASPER,WY,826013324,SELF-EMPLOYED,POLITICAL CONSULTANT AND COACH,10.0,28-MAR-12,NaN,NaN,NaN,SA17A,780234,Democrat
701358,C00431445,P80003338,"Obama, Barack","HAGEN, MARTIN",JACKSON,WY,83002,TETON COUNTY SCHOOL DIST. #1,BUS DRIVER,25.0,17-MAR-12,NaN,NaN,NaN,SA17A,780234,Democrat
701359,C00431445,P80003338,"Obama, Barack","MILLS, DAVID",JACKSON,WY,830010452,RETIRED,RETIRED,75.0,31-MAR-12,NaN,NaN,NaN,SA17A,780234,Democrat
701360,C00431445,P80003338,"Obama, Barack","PHELPS, WILLIAM",JACKSON,WY,830012585,SELF-EMPLOYED,SELF-EMPLOYED,100.0,02-MAR-12,NaN,NaN,NaN,SA17A,780234,Democrat
701361,C00431445,P80003338,"Obama, Barack","MARLATT, GORDON",LARAMIE,WY,82070,SELF-EMPLOYED,GEOLOGIST,25.0,07-MAR-12,NaN,NaN,NaN,SA17A,780234,Democrat
701362,C00431445,P80003338,"Obama, Barack","GOTTFRIED, BETTE",CASPER,WY,826043172,RETIRED,RETIRED,200.0,25-APR-12,NaN,NaN,NaN,SA17A,785239,Democrat
701363,C00431445,P80003338,"Obama, Barack","STOVAL, LINDA",CASPER,WY,826013324,SELF-EMPLOYED,POLITICAL CONSULTANT AND COACH,25.0,23-APR-12,NaN,NaN,NaN,SA17A,785239,Democrat
701364,C00431445,P80003338,"Obama, Barack","MILES, MATTHEW",ALPINE,WY,831280665,SELF-EMPLOYED,BUSINESS MANAGEMENT,50.0,20-APR-12,NaN,NaN,NaN,SA17A,785239,Democrat
701365,C00431445,P80003338,"Obama, Barack","NELSON, JANE B.",CHEYENNE,WY,820098901,RETIRED,RETIRED,50.0,30-APR-12,NaN,NaN,NaN,SA17A,785239,Democrat
701366,C00431445,P80003338,"Obama, Barack","HAGEN, MARTIN",JACKSON,WY,83002,TETON COUNTY SCHOOL DIST. #1,BUS DRIVER,19.0,26-APR-12,NaN,NaN,NaN,SA17A,785239,Democrat
701367,C00431445,P80003338,"Obama, Barack","EMORY, DENNIS S",WILSON,WY,830140190,SELF-EMPLOYED,CONSULTANT,100.0,19-APR-12,NaN,NaN,NaN,SA17A,785239,Democrat
701368,C00431445,P80003338,"Obama, Barack","IRWIN, C. DON",DOUGLAS,WY,826339515,INFORMATION REQUESTED,INFORMATION REQUESTED,150.0,05-APR-12,NaN,NaN,NaN,SA17A,785239,Democrat
701369,C00431445,P80003338,"Obama, Barack","LIU, FREDERICK",JACKSON,WY,830010788,NOT EMPLOYED,RETIRED,56.0,26-APR-12,NaN,NaN,NaN,SA17A,785239,Democrat
701370,C00431445,P80003338,"Obama, Barack","KNIGHT, CINDY",JACKSON,WY,830012194,TETON YOUTH AND FAMILY SERVICES,PROGRAM DIRECTOR,100.0,19-APR-12,NaN,NaN,NaN,SA17A,785239,Democrat
701371,C00431445,P80003338,"Obama, Barack","NEAL, AMBER",APO,ZZ,091022065,THE DEPARTMENT OF DEFENSE EDUCATION AC,TEACHER,50.0,04-SEP-11,NaN,NaN,NaN,SA17A,756218,Democrat
701372,C00431445,P80003338,"Obama, Barack","MOUNTS, ROBERT",APO,ZZ,962043077,HQ USFK (FKDC-SA),GS-15 INTERNATIONAL RELATIONS OFFICER,25.0,26-MAR-12,NaN,NaN,NaN,SA17A,780234,Democrat
701373,C00431445,P80003338,"Obama, Barack","MOUNTS, ROBERT",APO,ZZ,962043077,HQ USFK (FKDC-SA),GS-15 INTERNATIONAL RELATIONS OFFICER,25.0,26-OCT-11,NaN,NaN,NaN,SA17A,772372,Democrat
701374,C00431445,P80003338,"Obama, Barack","TUCKER, PAMELA",APO,ZZ,963190030,DODEA,EDUCATOR,100.0,31-DEC-11,NaN,NaN,NaN,SA17A,772372,Democrat
701375,C00431445,P80003338,"Obama, Barack","MOUNTS, ROBERT",APO,ZZ,962043077,HQ USFK (FKDC-SA),GS-15 INTERNATIONAL RELATIONS OFFICER,25.0,26-DEC-11,NaN,NaN,NaN,SA17A,772372,Democrat
701376,C00431445,P80003338,"Obama, Barack","JONES, LESLIE",HAMILTON PARISH,ZZ,0CR04,SELF-EMPLOYED,ATTORNEY,2500.0,30-DEC-11,NaN,X,* OBAMA VICTORY FUND 2012,SA18,772372,Democrat
701377,C00431445,P80003338,"Obama, Barack","MOUNTS, ROBERT",APO,ZZ,962043077,HQ USFK (FKDC-SA),GS-15 INTERNATIONAL RELATIONS OFFICER,25.0,26-NOV-11,NaN,NaN,NaN,SA17A,772372,Democrat
701378,C00431445,P80003338,"Obama, Barack","MOUNTS, ROBERT",APO,ZZ,962043077,HQ USFK (FKDC-SA),GS-15 INTERNATIONAL RELATIONS OFFICER,25.0,26-JAN-12,NaN,NaN,NaN,SA17A,775668,Democrat
701379,C00431445,P80003338,"Obama, Barack","GOLDSTINE, RAYMOND",APO,ZZ,09831,CDC,PUBLIC HEALTH ADVISOR,250.0,02-FEB-12,NaN,NaN,NaN,SA17A,787803,Democrat
701380,C00431445,P80003338,"Obama, Barack","JONES, LESLIE",HAMILTON PARISH,ZZ,0CR04,SELF-EMPLOYED,ATTORNEY,2500.0,30-DEC-11,NaN,X,* OBAMA VICTORY FUND 2012,SA18,772372,Democrat
701381,C00431445,P80003338,"Obama, Barack","MOUNTS, ROBERT",APO,ZZ,962043077,HQ USFK (FKDC-SA),GS-15 INTERNATIONAL RELATIONS OFFICER,25.0,26-FEB-12,NaN,NaN,NaN,SA17A,787803,Democrat
701382,C00431445,P80003338,"Obama, Barack","TAITANO, TYRONE",HAGATNA,ZZ,969323373,NOT EMPLOYED,RETIRED,250.0,20-JAN-12,NaN,NaN,NaN,SA17A,775668,Democrat
701383,C00431445,P80003338,"Obama, Barack","TUCKER, PAMELA",APO,ZZ,963190030,DODEA,EDUCATOR,3.0,20-JAN-12,NaN,NaN,NaN,SA17A,775668,Democrat
701384,C00431445,P80003338,"Obama, Barack","MOUNTS, ROBERT",APO,ZZ,962043077,HQ USFK (FKDC-SA),GS-15 INTERNATIONAL RELATIONS OFFICER,25.0,26-APR-12,NaN,NaN,NaN,SA17A,785239,Democrat
701385,C00431445,P80003338,"Obama, Barack","NEAL, AMBER",APO,ZZ,091022065,THE DEPARTMENT OF DEFENSE EDUCATION AC,TEACHER,135.0,04-SEP-11,NaN,X,* OBAMA VICTORY FUND 2012,SA18,756218,Democrat

## 根据职业和雇主统计赞助信息

In [253]:
fec.contbr_occupation.value_counts()[:10]

RETIRED                                   233990
INFORMATION REQUESTED                      35107
ATTORNEY                                   34286
HOMEMAKER                                  29931
PHYSICIAN                                  23432
INFORMATION REQUESTED PER BEST EFFORTS     21138
ENGINEER                                   14334
TEACHER                                    13990
CONSULTANT                                 13273
PROFESSOR                                  12555
Name: contbr_occupation, dtype: int64

In [254]:
occ_mapping ={
    'INFORMATION REQUESTED PER BEST EFFORTS': 'NOT PROVIDED',
    'INFORMATION REQUESTED': 'NOT PROVIDED',
    'INFORMATION REQUESTED (BEST EFFORTS)': 'NOT PROVIDED',
    'C.E.O.':'CEO'
    
}

In [255]:
f = lambda x:occ_mapping.get(x,x)

In [257]:
fec.contbr_occupation = fec.contbr_occupation.apply(f)

/home/zhanghui/py35/lib/python3.5/site-packages/pandas/core/generic.py:3110: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[name] = value

In [259]:
fec.head()

,cmte_id,cand_id,cand_nm,contbr_nm,contbr_city,contbr_st,contbr_zip,contbr_employer,contbr_occupation,contb_receipt_amt,contb_receipt_dt,receipt_desc,memo_cd,memo_text,form_tp,file_num,party
0,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,3.6601e+08,RETIRED,RETIRED,250.0,20-JUN-11,NaN,NaN,NaN,SA17A,736166,Republican
1,C00410118,P20002978,"Bachmann, Michelle","HARVEY, WILLIAM",MOBILE,AL,3.6601e+08,RETIRED,RETIRED,50.0,23-JUN-11,NaN,NaN,NaN,SA17A,736166,Republican
2,C00410118,P20002978,"Bachmann, Michelle","SMITH, LANIER",LANETT,AL,3.68633e+08,INFORMATION REQUESTED,NOT PROVIDED,250.0,05-JUL-11,NaN,NaN,NaN,SA17A,749073,Republican
3,C00410118,P20002978,"Bachmann, Michelle","BLEVINS, DARONDA",PIGGOTT,AR,7.24548e+08,NONE,RETIRED,250.0,01-AUG-11,NaN,NaN,NaN,SA17A,749073,Republican
4,C00410118,P20002978,"Bachmann, Michelle","WARDENBURG, HAROLD",HOT SPRINGS NATION,AR,7.19016e+08,NONE,RETIRED,300.0,20-JUN-11,NaN,NaN,NaN,SA17A,736166,Republican

In [262]:
by_occupation = fec.pivot_table('contb_receipt_amt',
                                index = 'contbr_occupation',
                                columns='party',
                                aggfunc='sum'

)

In [263]:
by_occupation

party                                  Democrat  Republican
contbr_occupation
   MIXED-MEDIA ARTIST / STORYTELLER       100.0         NaN
 AREA VICE PRESIDENT                      250.0         NaN
 RESEARCH ASSOCIATE                       100.0         NaN
 TEACHER                                  500.0         NaN
 THERAPIST                               3900.0         NaN
'MIS MANAGER                                NaN      177.60
(PART-TIME) SALES CONSULTANT & WRITER       NaN      285.00
(RETIRED)                                 250.0         NaN
-                                        5000.0     2114.80
--                                          NaN       75.00
.NET PROGRAMMER                           481.0         NaN
0                                          20.0         NaN
07/13/1972                                 98.0         NaN
100% DISABLED ARMY VET                      NaN      350.00
100% DISABLED VETERAN                       NaN     2080.78
100% DISABLED VIET NAM COMBAT VETER         NaN      100.00
100% DISABLED VIETNAM VETERAN               NaN      236.25
11B                                         NaN      300.00
12K ADVOCATE                              150.0         NaN
13B CANNON CREWMEMBER                       NaN       71.80
13D                                       721.0         NaN
15J                                         NaN      150.00
15U - CHINOOK MECHANIC                      NaN      200.00
1SG RETIRED                               210.0         NaN
1ST ASSISTANT DIRECTOR 2ND UNIT            35.0         NaN
1ST ASSISTANT SOUND EDITOR                  NaN      292.80
1ST GRADE TEACHER                         435.0         NaN
1ST LIEUTENANT (MILITARY OFFICER)           NaN      500.00
1ST LIEUTENANT (RET)                        NaN      449.50
1ST LT                                      NaN      500.00
...                                         ...         ...
YOUTH CORRECTIONS SUPERVISOR               50.0         NaN
YOUTH COUNSELOR                             NaN     1133.05
YOUTH COUNTRY CHAIR                         NaN      250.00
YOUTH DEVELOPMENT                         650.0         NaN
YOUTH DIRECTOR                            550.0      546.32
YOUTH MINISTER                            725.0      780.24
YOUTH MINISTRY                              NaN      250.00
YOUTH OUTREACH DIRECTOR                     NaN     1000.00
YOUTH PASTOR                                NaN      335.00
YOUTH PROGRAMS DIRECTOR                   205.0         NaN
YOUTH SERVICE AIDE                          NaN       88.60
YOUTH SERVICE COORDINATOR                 425.0         NaN
YOUTH SERVICES LIBRARIAN                  290.0         NaN
YOUTH SERVICES MANAGER                    300.0         NaN
YOUTH SPECIALIST                          652.0         NaN
YOUTH SPORTS DIRECTOR                     110.0         NaN
YOUTH VOTE DIRECTOR                       165.0         NaN
YOUTH WORKER                                NaN     1011.74
ZEN BUDDHIST PRIEST                       400.0         NaN
ZEN TEACHER                               100.0         NaN
ZEPPOS AND ASSOCIATES                    1000.0         NaN
ZIMMERMANS DAIRY                            NaN       83.71
ZMS                                         NaN       70.12
ZOMBIE SLAYER                               NaN      125.00
ZONE MANAGER                              135.0         NaN
ZOOKEEPER                                  35.0         NaN
ZOOLOGIST                                 400.0         NaN
ZOOLOGY EDUCATION                          25.0         NaN
\NONE\                                      NaN      250.00
~                                           NaN       75.00

[45064 rows x 2 columns]

In [265]:
over_2mm = by_occupation[by_occupation.sum(1)>2000000]

In [268]:
over_2mm.head()

party                 Democrat  Republican
contbr_occupation
ATTORNEY           11965397.89  6653779.51
CEO                 2640072.58  3645942.73
CONSULTANT          2781327.71  2223310.45
ENGINEER            1156978.95  1612920.30
EXECUTIVE           2100655.99  3393355.15

In [270]:
%matplotlib
over_2mm.plot(kind='barh')

Using matplotlib backend: TkAgg

In [280]:
def get_top_amounts(group, key, n=5):
    totals = group.groupby(key)['contb_receipt_amt'].sum()
    return totals.sort_values(ascending=False)[n:]

In [272]:
grouped = fec_mrbo.groupby('cand_nm')

In [275]:
get_top_amounts7 = lambda x:get_top_amounts(x,'contbr_occupation', n=7)

In [282]:
grouped.apply(get_top_amounts7).head()

cand_nm        contbr_occupation
Obama, Barack  PROFESSOR            2165071.08
               CEO                  2073284.79
               PRESIDENT            1878509.95
               NOT EMPLOYED         1709188.20
               EXECUTIVE            1355161.05
Name: contb_receipt_amt, dtype: float64

## 对出资金额分组

In [283]:
bins  = np.array([0,1,10,100,1000,10000,100000,1000000,10000000])

In [284]:
bins

array([       0,        1,       10,      100,     1000,    10000,
         100000,  1000000, 10000000])

In [285]:
labels = pd.cut(fec_mrbo.contb_receipt_amt, bins)

In [287]:
labels.head()

411      (10, 100]
412    (100, 1000]
413    (100, 1000]
414      (10, 100]
415      (10, 100]
Name: contb_receipt_amt, dtype: category
Categories (8, interval[int64]): [(0, 1] < (1, 10] < (10, 100] < (100, 1000] < (1000, 10000] < (10000, 100000] < (100000, 1000000] < (1000000, 10000000]]

In [288]:
grouped = fec_mrbo.groupby(['cand_nm', labels])

In [289]:
grouped.size()

cand_nm        contb_receipt_amt
Obama, Barack  (0, 1]                    493
               (1, 10]                 40070
               (10, 100]              372280
               (100, 1000]            153991
               (1000, 10000]           22284
               (10000, 100000]             2
               (100000, 1000000]           3
               (1000000, 10000000]         4
Romney, Mitt   (0, 1]                     77
               (1, 10]                  3681
               (10, 100]               31853
               (100, 1000]             43357
               (1000, 10000]           26186
               (10000, 100000]             1
dtype: int64

In [291]:
grouped.size().unstack(0)

cand_nm              Obama, Barack  Romney, Mitt
contb_receipt_amt
(0, 1]                       493.0          77.0
(1, 10]                    40070.0        3681.0
(10, 100]                 372280.0       31853.0
(100, 1000]               153991.0       43357.0
(1000, 10000]              22284.0       26186.0
(10000, 100000]                2.0           1.0
(100000, 1000000]              3.0           NaN
(1000000, 10000000]            4.0           NaN

In [292]:
bucket_sums = grouped.contb_receipt_amt.sum()

In [293]:
bucket_sums

cand_nm        contb_receipt_amt
Obama, Barack  (0, 1]                      318.24
               (1, 10]                  337267.62
               (10, 100]              20288981.41
               (100, 1000]            54798531.46
               (1000, 10000]          51753705.67
               (10000, 100000]           59100.00
               (100000, 1000000]       1490683.08
               (1000000, 10000000]     7148839.76
Romney, Mitt   (0, 1]                       77.00
               (1, 10]                   29819.66
               (10, 100]               1987783.76
               (100, 1000]            22363381.69
               (1000, 10000]          63942145.42
               (10000, 100000]           12700.00
Name: contb_receipt_amt, dtype: float64

In [294]:
bucket_sums = grouped.contb_receipt_amt.sum().unstack(0)

In [295]:
bucket_sums

cand_nm              Obama, Barack  Romney, Mitt
contb_receipt_amt
(0, 1]                      318.24         77.00
(1, 10]                  337267.62      29819.66
(10, 100]              20288981.41    1987783.76
(100, 1000]            54798531.46   22363381.69
(1000, 10000]          51753705.67   63942145.42
(10000, 100000]           59100.00      12700.00
(100000, 1000000]       1490683.08           NaN
(1000000, 10000000]     7148839.76           NaN

In [298]:
bucket_sums.sum(axis=1)

contb_receipt_amt
(0, 1]                 3.952400e+02
(1, 10]                3.670873e+05
(10, 100]              2.227677e+07
(100, 1000]            7.716191e+07
(1000, 10000]          1.156959e+08
(10000, 100000]        7.180000e+04
(100000, 1000000]      1.490683e+06
(1000000, 10000000]    7.148840e+06
dtype: float64

In [296]:
normed_sums = bucket_sums.div(bucket_sums.sum(axis=1), axis=0)

In [297]:
normed_sums

cand_nm              Obama, Barack  Romney, Mitt
contb_receipt_amt
(0, 1]                    0.805182      0.194818
(1, 10]                   0.918767      0.081233
(10, 100]                 0.910769      0.089231
(100, 1000]               0.710176      0.289824
(1000, 10000]             0.447326      0.552674
(10000, 100000]           0.823120      0.176880
(100000, 1000000]         1.000000           NaN
(1000000, 10000000]       1.000000           NaN

In [299]:
normed_sums[:-2].plot(kind='barh', stacked=True)

## 根据州统计赞助赞助信息

In [301]:
grouped = fec_mrbo.groupby(['cand_nm', 'contbr_st'])

In [302]:
grouped

In [305]:
totals = grouped.contb_receipt_amt.sum().unstack().fillna(0)

In [306]:
totals

contbr_st,AA,AB,AE,AK,AL,AP,AR,AS,AZ,CA,...,UT,VA,VI,VT,WA,WI,WV,WY,XX,ZZ
cand_nm,,,,,,,,,,,,,,,,,,,,,
"Obama, Barack",56405.0,2048.0,42973.75,281840.15,543123.48,37130.5,359247.28,2955.0,1506476.98,23824984.24,...,519851.37,4259977.19,80712.0,986510.59,4250933.16,1130155.46,169154.47,194046.74,0.0,5963.0
"Romney, Mitt",135.0,0.0,5680.00,86204.24,527303.51,1655.0,105556.00,0.0,1888436.23,11237636.60,...,3717300.48,3465765.85,3500.0,55229.44,1341521.56,270316.32,126725.12,252595.84,400250.0,0.0

In [307]:
totals= totals[totals.sum(1)>100000]

In [308]:
totals

contbr_st,AA,AB,AE,AK,AL,AP,AR,AS,AZ,CA,...,UT,VA,VI,VT,WA,WI,WV,WY,XX,ZZ
cand_nm,,,,,,,,,,,,,,,,,,,,,
"Obama, Barack",56405.0,2048.0,42973.75,281840.15,543123.48,37130.5,359247.28,2955.0,1506476.98,23824984.24,...,519851.37,4259977.19,80712.0,986510.59,4250933.16,1130155.46,169154.47,194046.74,0.0,5963.0
"Romney, Mitt",135.0,0.0,5680.00,86204.24,527303.51,1655.0,105556.00,0.0,1888436.23,11237636.60,...,3717300.48,3465765.85,3500.0,55229.44,1341521.56,270316.32,126725.12,252595.84,400250.0,0.0

In [309]:
totals.sum(1)>100000

cand_nm
Obama, Barack    True
Romney, Mitt     True
dtype: bool

In [311]:
percent = totals.div(totals.sum(1),axis=0)
percent

contbr_st,AA,AB,AE,AK,AL,AP,AR,AS,AZ,CA,...,UT,VA,VI,VT,WA,WI,WV,WY,XX,ZZ
cand_nm,,,,,,,,,,,,,,,,,,,,,
"Obama, Barack",0.000415,0.000015,0.000316,0.002074,0.003997,0.000273,0.002644,0.000022,0.011087,0.175344,...,0.003826,0.031352,0.000594,0.007260,0.031285,0.008318,0.001245,0.001428,0.000000,0.000044
"Romney, Mitt",0.000002,0.000000,0.000064,0.000976,0.005969,0.000019,0.001195,0.000000,0.021378,0.127215,...,0.042081,0.039234,0.000040,0.000625,0.015187,0.003060,0.001435,0.002859,0.004531,0.000000

In [312]:
percent = totals.div(totals.sum(1),axis=1)
percent

,AA,AB,AE,AK,AL,AP,AR,AS,AZ,CA,...,UT,VA,VI,VT,WA,WI,WV,WY,XX,ZZ
cand_nm,,,,,,,,,,,,,,,,,,,,,
"Obama, Barack",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
"Romney, Mitt",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [313]:
totals.sum(1)

cand_nm
Obama, Barack    1.358756e+08
Romney, Mitt     8.833591e+07
dtype: float64

## 赞助信息的美国地图

In [334]:
from mpl_toolkits.basemap import Basemap , cm
import numpy as np
from matplotlib import rcParams
from matplotlib.collections import LineCollection
import matplotlib.pyplot as plt

# from shapelib import ShapeFile
# import dbflib
obama = percent['Obama, Barack']

In [346]:
fig = plt.figure(figsize=(12,12))

In [347]:
ax = fig.add_axes([0.1,0.1,0.8,0.8])

In [348]:
lllat = 21; urlat=53;lllon=-118;urlon=-62

In [349]:
m = Basemap(ax= ax,
           projection='stere',
            lon_0=(urlon + lllon)/2,
            lat_0=(urlat + lllat)/2,
           llcrnrlat = lllat,
            urcrnrlat = urlat,
            llcrnrlon = lllon,
            urcrnrlon = urlon,
            resolution = 'l'
           )

In [350]:
m.drawcoastlines()
m.drawcountries()

In [351]:
import dbflib

ImportError: No module named 'dbflib'

In [352]:
from matplotlib import dbflib

ImportError: cannot import name 'dbflib'